hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
static void web_auth_note_failure(uint32_t ip) {
    web_auth_track_t *t = web_auth_track_find(ip);
    if (t->fail_count < UINT16_MAX)
        t->fail_count++;

    if (t->fail_count >= WEB_AUTH_MAX_ATTEMPTS) {
        // Every failure beyond the threshold doubles the lockout, so a
        // client that keeps hammering the lockout window (rather than
        // waiting it out) backs off exponentially instead of retrying at a
        // fixed cadence.
        uint32_t over = t->fail_count - WEB_AUTH_MAX_ATTEMPTS;
        uint32_t shift = over > 8 ? 8 : over; // cap the shift so it can't overflow
        uint32_t lockout_s = WEB_AUTH_LOCKOUT_BASE_S << shift;
        if (lockout_s > WEB_AUTH_LOCKOUT_MAX_S)
            lockout_s = WEB_AUTH_LOCKOUT_MAX_S;
        t->locked_until = esp_timer_get_time() + (int64_t)lockout_s * 1000000;
        ESP_LOGW(TAG, "Web admin login: %u consecutive failures, locked out for %u s", (unsigned)t->fail_count, (unsigned)lockout_s);
    }
}

static void web_auth_note_success(uint32_t ip) {
    for (int i = 0; i < WEB_AUTH_TRACK_SLOTS; i++) {
        if (s_auth_track[i].ip == ip) {
            s_auth_track[i].ip = 0;
            s_auth_track[i].fail_count = 0;
            s_auth_track[i].locked_until = 0;
            return;
        }
    }
}

// ------------------------------------------------------------- CSRF (Origin/Referer)
//
// Every admin route is gated only by HTTP Basic Auth, and browsers attach
// cached Basic credentials to *any* request sent to this device's origin -
// regardless of which page's script or hidden auto-submitting form actually
// triggered it. Without a same-origin check, a page on a completely
// different site, opened by an already-authenticated admin in another tab,
// could silently POST to e.g. /system or /format and have it succeed.
// There's no per-session token to check instead (this server has no
// cookies/sessions at all - only stateless Basic Auth), so the mitigation
// here is a same-origin check on state-changing (POST) requests: compare
// the browser-supplied Origin (or, failing that, Referer) header's host
// against this request's own Host header. Modern browsers always attach an
// Origin header to POST requests, same-origin or not, so a legitimate
// same-site form submission always has one to check; a request with
// neither header, or one whose host doesn't match, cannot be trusted to be
// same-origin and is rejected.
//
// This only ever needs to run for state-changing requests, and that rests
// on one invariant the route table has to keep: no registered GET route may
// have a side effect. It cannot be enforced by extending the check to GETs
// instead - a browser sends neither Origin nor Referer when a URL is typed
// into the address bar or opened from a bookmark, so a same-origin check on
// GET would fail closed on ordinary navigation and lock the admin UI out
// entirely. The obligation therefore sits on whoever adds a route: anything
// that changes state, keys the radio, reconfigures an interface or writes
// flash is registered HTTP_POST, which both brings it under this check and
// puts it out of reach of the ways a browser fetches a URL by itself
// (<img src>, script/stylesheet loads, prefetch, link prerender). See
// page_radio.c's /radio/looptest and page_wireless.c's /wifiscan for two
// endpoints that read like queries but are POST for exactly this reason,
// page_logs.c for a page whose own script posts /logs/stop as it loads
// rather than letting the GET that renders it stop a running capture, and
// page_storage.c for why /delete etc. are POST-only forms.

// Compares the host[:port] authority component of a "<scheme>://host[:port]/..."
// header value (Origin or Referer) against this request's own Host header
// value. Only the authority component of hdr_value is considered, so a
// Referer's path/query can't cause a false match or mismatch.
static bool web_origin_host_matches(const char *hdr_value, const char *expected_host) {
    const char *authority = strstr(hdr_value, "://");
    if (!authority)
        return false;
    authority += 3;

    size_t host_len = strlen(expected_host);
    if (host_len == 0)
        return false;
    if (strncasecmp(authority, expected_host, host_len) != 0)
        return false;

    // The matched prefix must be the *whole* authority component, not just a
    // prefix of a longer host (e.g. expected "example.com" must not match
    // "example.com.evil.tld"): what follows has to end the authority, i.e.
    // be the path/query/fragment separator or the end of the string.
    char term = authority[host_len];
    return term == 0 || term == '/' || term == '?' || term == '#';
}

// Returns true only if this state-changing request can be confirmed
// same-origin via Origin (preferred) or Referer (fallback). Fails closed:
// a missing Host header, or a request with neither Origin nor Referer, is
// treated as not-same-origin rather than silently allowed through.
static bool web_check_csrf_origin(httpd_req_t *req) {
    char host[128];
    if (httpd_req_get_hdr_value_str(req, "Host", host, sizeof(host)) != ESP_OK || host[0] == 0)
        return false;

    char origin[256];
    if (httpd_req_get_hdr_value_str(req, "Origin", origin, sizeof(origin)) == ESP_OK && origin[0] != 0)
        return web_origin_host_matches(origin, host);

    char referer[256];
    if (httpd_req_get_hdr_value_str(req, "Referer", referer, sizeof(referer)) == ESP_OK && referer[0] != 0)
        return web_origin_host_matches(referer, host);

    return false; // neither header present: can't confirm same-origin
}

// ---------------------------------------------------------------- Basic Auth
bool web_check_auth(httpd_req_t *req) {
    // Same-origin check first, before Basic Auth is even evaluated and before
    // the "no password configured" bypass below: a cross-site request has no
    // business reaching this handler regardless of whether it happens to
    // carry valid cached credentials, and CSRF is the attack that matters
    // most precisely when there is no password to leak in the first place.
    if (req->method == HTTP_POST && !web_check_csrf_origin(req)) {
        httpd_resp_set_status(req, "403 Forbidden");
        httpd_resp_set_type(req, "text/html");
        web_send_standalone_page(req, "<h1>" TR_FORBIDDEN_CSRF "</h1>");
        return false;
    }

