hiperiondev/esp32idf_APRS/components/webconfig/web_common.c
    if (g_config.http_username[0] == 0)
        return true; // auth disabled if no user set; same-origin check above still applies

    uint32_t client_ip = web_client_ipv4(req);
    int lockout_remaining_s = web_auth_lockout_remaining_s(client_ip);
    if (lockout_remaining_s > 0) {
        // Reject before even looking at the Authorization header: a locked
        // source doesn't get another guess to spend, and doesn't get any
        // extra timing signal either.
        httpd_resp_set_status(req, "429 Too Many Requests");
        char retry_hdr[16];
        snprintf(retry_hdr, sizeof(retry_hdr), "%d", lockout_remaining_s);
        httpd_resp_set_hdr(req, "Retry-After", retry_hdr);
        httpd_resp_set_type(req, "text/html");
        web_send_standalone_page(req, "<h1>" TR_UNAUTHORIZED "</h1>");
        return false;
    }

    char hdr[160];
    if (httpd_req_get_hdr_value_str(req, "Authorization", hdr, sizeof(hdr)) != ESP_OK) {
        goto challenge; // no Authorization header: first half of the Basic handshake, not a guess
    }
    if (strncmp(hdr, "Basic ", 6) != 0)
        goto challenge; // not a Basic credential: same as no header for counting purposes

    {
        unsigned char decoded[128];
        size_t outlen = 0;
        int rc = web_base64_decode(decoded, sizeof(decoded) - 1, &outlen, (const unsigned char *)(hdr + 6), strlen(hdr + 6));
        if (rc != 0)
            goto need_auth;
        decoded[outlen] = 0;

        char *sep = strchr((char *)decoded, ':');
        if (!sep)
            goto need_auth;
        *sep = 0;
        const char *user = (char *)decoded;
        const char *pass = sep + 1;

        // Constant-time compare: strcmp() short-circuits on the first
        // mismatching byte, which leaks (via response timing) how many
        // leading characters of a guess were correct. Both fields are
        // fixed-size buffers in g_config, so comparing the full field width
        // costs nothing here.
        if (web_const_time_streq(user, g_config.http_username) && web_const_time_streq(pass, g_config.http_password)) {
            web_auth_note_success(client_ip);
            return true;
        }
    }

need_auth:
    // Reached only when credentials were actually presented and rejected:
    // a malformed Basic payload, or a user/password mismatch. This is the
    // one case that counts as a guess against the lockout budget.
    web_auth_note_failure(client_ip);

challenge:
    // Sends the 401 challenge without touching the lockout counter: every
    // browser reaches this on the first, credential-less half of the Basic
    // Auth handshake, so it must never be charged against the budget that
    // protects the real guesses handled above.
    httpd_resp_set_status(req, "401 Unauthorized");
    httpd_resp_set_hdr(req, "WWW-Authenticate", "Basic realm=\"" APRS_SOFTWARE_NAME "\"");
    httpd_resp_set_type(req, "text/html");
    web_send_standalone_page(req, "<h1>" TR_UNAUTHORIZED "</h1>");
    return false;
}

// ---------------------------------------------------------------- Body read
int web_read_body(httpd_req_t *req, char *buf, size_t buf_size) {
    if (req->content_len >= buf_size) {
        ESP_LOGW(TAG, "body too large: %d >= %d", (int)req->content_len, (int)buf_size);
        return -1;
    }
    int total = 0;
    while (total < req->content_len) {
        int r = httpd_req_recv(req, buf + total, req->content_len - total);
        if (r <= 0) {
            if (r == HTTPD_SOCK_ERR_TIMEOUT)
                continue;
            return -1;
        }
        total += r;
    }
    buf[total] = 0;
    return total;
}

// ---------------------------------------------------------------- URL decode
// CR, LF and NUL are dropped as they are decoded rather than passed through:
// every caller of web_form_get() eventually writes the decoded value into a
// line-oriented output (an APRS-IS line, the AX.25 TNC2 text form, a JSON
// config value), and %0D/%0A let an operator smuggle either byte past a
// plain-text form field. Filtering here, at the one place every POSTed form
// value in this firmware is decoded, closes that path for every field
// without relying on each page's own POST handler to do it separately.
void web_urldecode(const char *src, char *dst, size_t dst_size) {
    size_t di = 0;
    while (*src && di + 1 < dst_size) {
        char c;
        if (*src == '%' && isxdigit((unsigned char)src[1]) && isxdigit((unsigned char)src[2])) {
            char hex[3] = { src[1], src[2], 0 };
            c = (char)strtol(hex, NULL, 16);
            src += 3;
        } else if (*src == '+') {
            c = ' ';
            src++;
        } else {
            c = *src++;
        }
        if (!str_is_line_break_char(c))
            dst[di++] = c;
    }
    dst[di] = 0;
}

bool web_form_get(const char *body, const char *key, char *out, size_t out_size) {
    if (!body)
        return false;
    size_t keylen = strlen(key);
    const char *p = body;
    while (p && *p) {
        const char *amp = strchr(p, '&');
        size_t seg_len = amp ? (size_t)(amp - p) : strlen(p);
        if (seg_len > keylen && p[keylen] == '=' && strncmp(p, key, keylen) == 0) {
            const char *valstart = p + keylen + 1;
            size_t vallen = seg_len - keylen - 1;
            char tmp[512];
            if (vallen >= sizeof(tmp))
                vallen = sizeof(tmp) - 1;
            memcpy(tmp, valstart, vallen);
            tmp[vallen] = 0;
            web_urldecode(tmp, out, out_size);
            return true;
        }
        // exact match with no '=' (rare) - checkbox absent case handled by caller default
        p = amp ? amp + 1 : NULL;
    }
    return false;
}

bool web_form_get_bool(const char *body, const char *key) {
    char v[16];
    if (!web_form_get(body, key, v, sizeof(v)))
        return false;
    return (strcmp(v, "on") == 0 || strcmp(v, "1") == 0 || strcasecmp(v, "true") == 0);
}

int web_form_get_int(const char *body, const char *key, int def) {
    char v[32];
    if (!web_form_get(body, key, v, sizeof(v)) || v[0] == 0)
        return def;
    return atoi(v);
}

float web_form_get_float(const char *body, const char *key, float def) {
    char v[32];
    if (!web_form_get(body, key, v, sizeof(v)) || v[0] == 0)
        return def;
    return strtof(v, NULL);
}

// ---------------------------------------------------------------- Output-side escaping
// (web_urldecode above handles the *input* direction, for query strings
// esp_httpd hands us; these three handle the *output* direction, for
// user-supplied strings - chiefly filenames - that get echoed back into
// hrefs/HTML/JS. Skipping this is what let a filename with a space or a
// quote character in it silently break the Storage page's delete/download
// links and onclick handlers.)

void web_urlencode(const char *src, char *dst, size_t dst_size) {
    if (!dst || dst_size == 0)
        return;
    static const char hex[] = "0123456789ABCDEF";
    size_t di = 0;
    for (const unsigned char *p = (const unsigned char *)src; src && *p && di + 1 < dst_size; p++) {
        unsigned char c = *p;
        if (isalnum(c) || c == '-' || c == '_' || c == '.' || c == '~') {
            dst[di++] = (char)c;
        } else {
            if (di + 3 >= dst_size)
                break;
            dst[di++] = '%';
            dst[di++] = hex[(c >> 4) & 0xF];
            dst[di++] = hex[c & 0xF];
        }
    }
    dst[di] = 0;
}

